Tekla Open API Reference for Tekla Structures 2025
AnalysisModelJobProperties.ReferenceNumber Property
 The reference number.
 Namespace: Tekla.Structures.Analysis
 Assembly: Tekla.Structures.Analysis (in Tekla.Structures.Analysis.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public string ReferenceNumber { get; set; }
Public Property ReferenceNumber As String
	Get
	Set
Property Value
Type: String
See Also
Reference
AnalysisModelJobProperties Class
Tekla.Structures.Analysis Namespace